{
  "rice": "Rice thrives in flooded conditions, but modern practices recommend drip irrigation to conserve water. Grows best in clay or loamy soil with high water retention. Regularly use nitrogen-rich fertilizers in split doses throughout the growing season. Monitor for rice weevils and other pests, and use integrated pest management strategies.",
  "apple": "Apples require a temperate climate with cold winters to set fruit properly. Prefers well-drained, loamy soil with a pH of 6.0-6.8. Regular pruning encourages airflow, reducing the risk of fungal diseases. Protect against codling moths and apple scab with proper sprays and organic practices.",
  "banana": "Bananas need consistent moisture, especially during fruiting. Prefers well-drained, loamy soil with organic matter. Use organic mulch to retain moisture. Use potassium-heavy fertilizers to improve fruit quality. Protect against Panama disease by rotating crops and maintaining soil health.",
  "grape": "Grapes grow best in well-drained, sandy or loamy soil with a pH between 5.5 and 7. Regular pruning increases fruit yield and airflow, reducing mildew. Support vines with trellises to optimize sunlight exposure. Use nitrogen and phosphorus fertilizers during early growth stages.",
  "tomato": "Tomatoes need full sunlight for at least 6-8 hours daily. Requires well-drained soil, rich in organic matter. Keep soil consistently moist to prevent blossom-end rot. Use companion planting to deter pests like aphids and hornworms.",
  "corn": "Corn needs full sun and well-drained soil. Plant in blocks for better pollination. Rotate crops yearly to maintain soil fertility. Keep soil moist during pollination to improve kernel development.",
  "carrot": "Carrots prefer loose, sandy soil to grow straight and avoid deformities. Ensure they are well-spaced. Thin seedlings after germination to avoid overcrowding. Avoid heavy watering, as it may cause root splitting.",
  "potato": "Potatoes grow best in well-drained, loose soil with consistent moisture. Mound soil around the base of plants as they grow to prevent sun exposure, which turns potatoes green. Use organic mulch to retain moisture and prevent weeds.",
  "lettuce": "Lettuce grows best in cool weather with partial shade. Needs regular watering to keep the leaves tender and prevent bitterness. Mulch to retain moisture and keep the soil cool.",
  "broccoli": "Broccoli prefers cool temperatures and well-drained soil. Space plants to allow for head development. Use nitrogen-rich fertilizers to promote growth, but avoid over-fertilizing to prevent leaf development over heads.",
  "cucumber": "Cucumbers need warm temperatures and consistent moisture. Plant in well-drained soil and use trellises to keep the fruit off the ground, preventing rot. Fertilize with balanced NPK fertilizers.",
  "pepper": "Peppers require warm temperatures and full sun. Plant in well-drained soil and water regularly. Use nitrogen fertilizers early in the growing season, then switch to potassium and phosphorus fertilizers to improve fruiting.",
  "onion": "Onions need full sun and well-drained soil. Keep them free of weeds to prevent competition. Water regularly, but avoid overwatering to prevent rot. Harvest when the tops start falling over naturally.",
  "spinach": "Spinach thrives in cool weather and requires consistent moisture. Avoid overcrowding plants to ensure proper air circulation. Use compost or nitrogen-rich fertilizers to boost growth.",
  "mango": "Mango trees need full sun and well-drained soil. Regular watering is important, especially when young. Prune occasionally to maintain shape and improve airflow. Fertilize with balanced NPK fertilizers.",
  "avocado": "Avocados require well-drained soil and full sun. Protect young trees from frost. Water regularly and use organic mulch to retain moisture. Fertilize with balanced fertilizers twice a year.",
  "chickpea": "Chickpeas grow well in well-drained soil with moderate watering. Avoid excessive moisture, which can cause root rot. Use nitrogen-fixing bacteria in the soil to enhance growth naturally.",
  "pomegranate": "Pomegranates need full sun and well-drained soil. Prune regularly to maintain tree shape and improve airflow. Water deeply but infrequently. Fertilize with compost or well-balanced fertilizers.",
  "wheat": "Wheat grows best in well-drained loamy or clay soil with moderate nitrogen levels. Use crop rotation to maintain soil fertility. Ensure the crop gets full sun and avoid waterlogging.",
  "soybean": "Soybeans prefer loamy, well-drained soil with a pH of 6-6.8. Inoculate seeds with nitrogen-fixing bacteria to promote growth. Regular, moderate watering is crucial.",
  "pumpkin": "Pumpkins need warm temperatures and rich, well-drained soil. Water regularly but avoid waterlogging. Space plants widely to allow for vine growth.",
  "beetroot": "Beetroot grows best in well-drained, loose soil. Requires full sun and consistent moisture. Thin plants after sprouting to allow space for root development.",
  "garlic": "Garlic needs well-drained, fertile soil and full sun. Plant in the fall for spring harvest. Regular watering is necessary, but avoid waterlogging.",
  "peas": "Peas grow well in cool, temperate climates with well-drained, fertile soil. Provide support like trellises for climbing varieties. Regular watering ensures tender peas.",
  "strawberry": "Strawberries prefer slightly acidic, well-drained soil. Ensure the plants receive full sun. Mulch with straw to prevent soil splashing and protect fruit from pests.",
  "cabbage": "Cabbage grows best in well-drained soil with a pH between 6.5 and 6.8. Requires consistent watering and cool temperatures for optimal growth.",
  "zucchini": "Zucchini prefers well-drained, fertile soil with regular watering. Plant in warm temperatures and provide plenty of space for sprawling vines.",
  "cauliflower": "Cauliflower thrives in cool climates with well-drained, fertile soil. Water regularly, but avoid overwatering. Space plants to ensure heads develop properly.",
  "okra": "Okra grows best in warm climates with well-drained, slightly acidic soil. Regular watering during flowering ensures tender pods.",
  "papaya": "Papayas need full sun and well-drained soil. Water regularly and fertilize with balanced fertilizers. Mulching helps retain moisture.",
  "ginger": "Ginger thrives in warm, humid climates with well-drained, loamy soil. Requires regular watering but avoid waterlogging. Mulch to retain moisture and regulate soil temperature.",
  "tea": "Tea plants need acidic, well-drained soil and partial shade. Regular pruning encourages leaf growth. Ensure consistent moisture, especially during dry seasons.",
  "coffee": "Coffee grows best in rich, well-drained soil in shaded areas. Regular watering is required, but avoid waterlogging. Prune to maintain plant shape and enhance fruit production.",
  "almond": "Almonds thrive in well-drained, sandy loam soil with full sun exposure. Regular irrigation is required, especially during fruit development. Prune regularly to maintain tree structure."
}
